cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "bat"
brew "detox"
brew "diskus"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "mas"
brew "mosh"
brew "nginx"
brew "pandoc"
brew "python"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "vim"

cask "1password"
cask "acorn"
cask "appcleaner"
cask "balenaetcher"
cask "basictex"
cask "brave-browser"
cask "flux"
cask "hazel"
cask "imageoptim"
cask "sketchup"
cask "sublime-merge"
cask "sublime-text"
cask "superduper"
cask "transmission"

mas "Acorn", id: 634108295
mas "Calca", id: 635758264
mas "FoldingText", id: 540003654
mas "JPEGmini", id: 498944723
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "PST Bridge", id: 457503727
mas "Reeder", id: 880001334
mas "Unbound", id: 690375005